将鱼图像数据进行操作，使用numpy知识

# Pandas的数据结构


导入pandas：  
三剑客

In [84]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
# 绘图，可视化
import matplotlib.pyplot as plt

### 1、Series

Series是一种类似与一维数组的对象，由下面两个部分组成：
- values：一组数据（ndarray类型）
- index：相关的数据索引标签

#### 1）Series的创建

两种创建方式：

(1) 由列表或numpy数组创建

    默认索引为0到N-1的整数型索引

    还可以通过设置index参数指定索引

特别地，由ndarray创建的是引用，而不是副本。对Series元素的改变也会改变原来的ndarray对象中的元素。（列表没有这种情况）

In [8]:
s = Series(data = np.random.randint(0, 150, size = 10),index = list('abcdefhijk'), name = 'Python')
s

a    123
b     81
c     75
d     55
e    139
f    106
h     78
i     47
j     68
k      7
Name: Python, dtype: int32

(2) 由字典创建

In [11]:
s2 = Series({'A':144,'B':137, 'C':125, 'D':99})
s2

A    144
B    137
C    125
D     99
dtype: int64

In [12]:
type(s)

pandas.core.series.Series

============================================

练习1：

使用多种方法创建以下Series，命名为s1：  
语文 150   
数学 150   
英语 150   
理综 300   

============================================

In [13]:
s3 = Series(data = np.array([150, 150, 150, 300]), index = np.array(['语文','数学','英语','理综']), name = '高考')
s3

语文    150
数学    150
英语    150
理综    300
Name: 高考, dtype: int32

In [16]:
s4 = Series({'语文':150, '数学':150, '英语':150, '理综': 300})
s4

语文    150
数学    150
英语    150
理综    300
dtype: int64

#### 2）Series的索引和切片

可以使用中括号取单个索引（此时返回的是元素类型），或者中括号里一个列表取多个索引（此时返回的仍然是一个Series类型）。分为显示索引和隐式索引：

(1) 显式索引：

    - 使用index中的元素作为索引值
    - 使用.loc[]（推荐）

 注意，此时是闭区间

In [17]:
s['d']

55

In [19]:
s[['d','e','e','e','e','e','e','e','e','e']]

d     55
e    139
e    139
e    139
e    139
e    139
e    139
e    139
e    139
e    139
Name: Python, dtype: int32

In [25]:
s.loc['d']

55

(2) 隐式索引：

    - 使用整数作为索引值
    - 使用.iloc[]（推荐）

 注意，此时是半开区间

In [23]:
s[4]

139

In [24]:
s.iloc[4]

139

In [27]:
s['a':'f']

a    123
b     81
c     75
d     55
e    139
f    106
Name: Python, dtype: int32

In [28]:
s.loc[::-2]

k      7
i     47
f    106
d     55
b     81
Name: Python, dtype: int32

================================================================

练习2：

使用多种方法对练习1创建的 serise s1进行索引和切片
索引：数学 150
切片：语文 150 数学 150 英语 150

In [35]:
print(s3.loc['数学'])
print(s3.iloc[0])

150
150

In [44]:
print(s3[0:3])
print(s3['语文':'英语'])
print(s3.loc['语文':'英语'])
print(s3.iloc[0:3])

语文    150
数学    150
英语    150
Name: 高考, dtype: int32
语文    150
数学    150
英语    150
Name: 高考, dtype: int32
语文    150
数学    150
英语    150
Name: 高考, dtype: int32
语文    150
数学    150
英语    150
Name: 高考, dtype: int32

#### 3）Series的基本概念

可以把Series看成一个定长的有序字典

可以通过shape，size，index,values等得到series的属性

In [45]:
s.size

10

In [46]:
s.shape

(10,)

In [47]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'h', 'i', 'j', 'k'], dtype='object')

In [48]:
#Series中的值就是ndarry
s.values

array([123,  81,  75,  55, 139, 106,  78,  47,  68,   7])

可以通过head(),tail()快速查看Series对象的样式

In [49]:
s.head()

a    123
b     81
c     75
d     55
e    139
Name: Python, dtype: int32

In [51]:
s.tail()

f    106
h     78
i     47
j     68
k      7
Name: Python, dtype: int32

可以使用pd.isnull()，pd.notnull()，或自带isnull(),notnull()函数检测缺失数据

当索引没有对应的值时，可能出现缺失数据显示NaN（not a number）的情况

In [54]:
s[['d', 'i']] = np.NAN
s

a    123.0
b     81.0
c     75.0
d      NaN
e    139.0
f    106.0
h     78.0
i      NaN
j     68.0
k      7.0
Name: Python, dtype: float64

In [56]:
#查看是否有空数据
cond = s.isnull()
s[cond]

d   NaN
i   NaN
Name: Python, dtype: float64

Series对象本身及其实例都有一个name属性

In [57]:
s2

A    144
B    137
C    125
D     99
dtype: int64

In [60]:
s2.name = 'Math'
s2

A    144
B    137
C    125
D     99
Name: Math, dtype: int64

#### 4）Series的运算

(1) 适用于numpy的数组运算也适用于Series

- 注意：要想保留所有的index，则需要使用.add()函数

In [63]:
s5 = s.add(10, fill_value = 0)
s5

a    133.0
b     91.0
c     85.0
d     10.0
e    149.0
f    116.0
h     88.0
i     10.0
j     78.0
k     17.0
Name: Python, dtype: float64

In [64]:
s5.astype(np.int8)

a   -123
b     91
c     85
d     10
e   -107
f    116
h     88
i     10
j     78
k     17
Name: Python, dtype: int8

In [65]:
s.mean()

84.625

In [67]:
s.max()

139.0

In [68]:
s.pow(2)

a    15129.0
b     6561.0
c     5625.0
d        NaN
e    19321.0
f    11236.0
h     6084.0
i        NaN
j     4624.0
k       49.0
Name: Python, dtype: float64

In [71]:
print(s)
s.value_counts()

a    123.0
b     81.0
c     75.0
d      NaN
e    139.0
f    106.0
h     78.0
i      NaN
j     68.0
k      7.0
Name: Python, dtype: float64

7.0      1
68.0     1
78.0     1
106.0    1
139.0    1
75.0     1
81.0     1
123.0    1
Name: Python, dtype: int64

练习：统计相同后缀的数量

In [76]:
li = ['xxx.mp3', 'sfsa.wav','asdasd.wav','weqwe.als','tfgrhdt.als','asdqwe.mp3']

In [78]:

def count_suffix(li):
    
    return Series([l.split('.')[-1] for l in li]).value_counts()

In [79]:
count_suffix(li)

mp3    2
als    2
wav    2
dtype: int64

============================================

练习3：

1. 想一想Series运算和ndarray运算的规则有什么不同？

2. 新建另一个索引包含“文综”的Series s2，并与s2进行多种算术操作。思考如何保存所有数据。

============================================

### 2、DataFrame

DataFrame是一个【表格型】的数据结构，可以看做是【由Series组成的字典】（共用同一个索引）。DataFrame由按一定顺序排列的多列数据组成。设计初衷是将Series的使用场景从一维拓展到多维。DataFrame既有行索引，也有列索引。
- 行索引：index
- 列索引：columns
- 值：values（numpy的二维数组）

In [90]:
print(np.array('ABCDE'))

ABCDE

#### 1）DataFrame的创建
最常用的方法是传递一个字典来创建。DataFrame以字典的键作为每一【列】的名称，以字典的值（一个数组）作为每一列。

此外，DataFrame会自动加上每一行的索引（和Series一样）。

同Series一样，若传入的列与字典的键不匹配，则相应的值为NaN。

In [91]:
df = DataFrame(data = {'python': np.random.randint(0, 150, size = 5),
                       'Math':np.random.randint(0, 150, size = 5),
                       'En':np.random.randint(0, 150, size = 5)}, 
                       index = list('ABCDE'))
df

   python  Math   En
A      36   106   10
B      30    99   71
C      32    32  142
D      89    62  107
E      61   146   60

In [122]:
np.random.randint(0, 150, size = 5)

array([ 88, 133,  89,  29,  92])

In [136]:
np.random.randint(0, 150, size = (10, 4)).shape

(10, 4)

In [94]:
df2 = DataFrame(data = np.random.randint(0, 150, size = (10, 4)), 
                                         index = list('ABCDEFHIJK'), 
                                         columns = ['Python', 'Math', 'En', 'Physic'])
df2

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96
H      42    57  101      18
I     136   130   18      48
J     145    59   51      45
K     104    85   68     103

In [95]:
#保存數據
df2.to_csv('./data.txt')
df2.to_excel('./data2.xlsx')

In [105]:
#读数据
df3 = pd.read_csv('data.txt')
df4 = df3.rename(mapper = {'Unnamed: 0':'index'}, axis = 1)
print(df4)
df4.set_index(keys = 'index')

  index  Python  Math   En  Physic
0     A      80   116  137     102
1     B      74   146  125      71
2     C      26    21   16     115
3     D      77   110   12       9
4     E     120    37   39      98
5     F      33    58   29      96
6     H      42    57  101      18
7     I     136   130   18      48
8     J     145    59   51      45
9     K     104    85   68     103

In [ ]:
# 结构化数据 sql， df结构化数据
# 半结构化数据
# 非结构化数据 网页。。

DataFrame属性：values、columns、index、shape

In [107]:
df.columns

Index(['python', 'Math', 'En'], dtype='object')

In [108]:
df3.index

RangeIndex(start=0, stop=10, step=1)

In [110]:
df4.index

RangeIndex(start=0, stop=10, step=1)

In [109]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [111]:
df.shape

(5, 3)

In [112]:
df.dtypes

python    int32
Math      int32
En        int32
dtype: object

============================================

练习4：

根据以下考试成绩表，创建一个DataFrame，命名为df：
```
    张三  李四
语文 150  0
数学 150  0
英语 150  0
理综 300  0
```

============================================

In [130]:
np.array([150]*4).shape

(4,)

In [132]:
np.zeros((4,))

array([0., 0., 0., 0.])

In [125]:
np.array(['语文','数学','英语','理综'])

array(['语文', '数学', '英语', '理综'], dtype='<U2')

In [139]:
np.array([[150,0]]*4)

array([[150,   0],
       [150,   0],
       [150,   0],
       [150,   0]])

In [140]:
df5 = DataFrame(data = {'张三':np.array([150]*4),
                        '李四':np.zeros((4,))},
                       index = np.array(['语文','数学','英语','理综']))
df6 = DataFrame(data = np.array([[150,0]]*4),
               index = np.array(['语文','数学','英语','理综']),
               columns = np.array(['张三', '李四'])
               )

In [143]:
df5

     张三   李四
语文  150  0.0
数学  150  0.0
英语  150  0.0
理综  150  0.0

In [141]:
df6

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  150   0

#### 2）DataFrame的索引

(1) 对列进行索引

    - 通过类似字典的方式
    - 通过属性的方式

 可以将DataFrame的列获取为一个Series。返回的Series拥有原DataFrame相同的索引，且name属性也已经设置好了，就是相应的列名。

In [144]:
df2.Python

A     80
B     74
C     26
D     77
E    120
F     33
H     42
I    136
J    145
K    104
Name: Python, dtype: int32

In [145]:
df2.En

A    137
B    125
C     16
D     12
E     39
F     29
H    101
I     18
J     51
K     68
Name: En, dtype: int32

In [149]:
df2

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96
H      42    57  101      18
I     136   130   18      48
J     145    59   51      45
K     104    85   68     103

In [151]:
df2[['Math','En']]

   Math   En
A   116  137
B   146  125
C    21   16
D   110   12
E    37   39
F    58   29
H    57  101
I   130   18
J    59   51
K    85   68

(2) 对行进行索引

    - 使用.ix[]来进行行索引
    - 使用.loc[]加index来进行行索引
    - 使用.iloc[]加整数来进行行索引
    
 同样返回一个Series，index为原来的columns。

In [152]:
df2.loc['A']

Python     80
Math      116
En        137
Physic    102
Name: A, dtype: int32

In [153]:
df2.loc[['A','B']]

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71

In [157]:
df2.iloc[[1]]

   Python  Math   En  Physic
B      74   146  125      71

(3) 对元素索引的方法
    - 使用列索引
    - 使用行索引(iloc[3,1]相当于两个参数;iloc[[3,3]] 里面的[3,3]看做一个参数)
    - 使用values属性（二维numpy数组）

In [158]:
df2['Math']['C']

21

In [159]:
df2.loc['B','En']#先行后列

125

In [178]:
df2.loc['C']['Math']

21

【注意】
直接用中括号时：
- 索引表示的是列索引
- 切片表示的是行切片

In [161]:
df2['Python':'En']#行切片

Empty DataFrame
Columns: [Python, Math, En, Physic]
Index: []

In [163]:
df2['A':'F']#对列进行切片

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96

In [166]:
df2.loc['A':'F']#对行切片

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96

In [169]:
df2.iloc[:,1:3]

   Math   En
A   116  137
B   146  125
C    21   16
D   110   12
E    37   39
F    58   29
H    57  101
I   130   18
J    59   51
K    85   68

============================================

练习5：

使用多种方法对ddd进行索引和切片，并比较其中的区别

============================================

In [172]:
df2

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96
H      42    57  101      18
I     136   130   18      48
J     145    59   51      45
K     104    85   68     103

In [176]:
#列切片
print(df2['Python':'En'])
#列索引.属性
print(df2.Math)

Empty DataFrame
Columns: [Python, Math, En, Physic]
Index: []
A    116
B    146
C     21
D    110
E     37
F     58
H     57
I    130
J     59
K     85
Name: Math, dtype: int32

In [186]:
#列索引，字典
df2[['Python','En']]

   Python   En
A      80  137
B      74  125
C      26   16
D      77   12
E     120   39
F      33   29
H      42  101
I     136   18
J     145   51
K     104   68

In [192]:
df2.loc['A']

Python     80
Math      116
En        137
Physic    102
Name: A, dtype: int32

In [196]:
df2.loc[['A','B']]

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71

In [ ]:
df2.loc[['A','B']]

In [199]:
print(df2.iloc[[1]])

   Python  Math   En  Physic
B      74   146  125      71

In [201]:
# 元素索引
df2['Math']['A']#先列后行
df2.loc['A']['Math']# 先行后列
df2.loc['A','Math']

116

In [204]:
#索引表示的是列索引，切片,行切片
df2['Python':'En']

Empty DataFrame
Columns: [Python, Math, En, Physic]
Index: []

In [205]:
df2['A':'F']#对列进行切片

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96

In [206]:
df2.loc['A':'F']#对行切片

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96

In [208]:
df2.iloc[1:4,1:3]

   Math   En
B   146  125
C    21   16
D   110   12

#### 3）DataFrame的运算

（1） DataFrame之间的运算

同Series一样：

- 在运算中自动对齐不同索引的数据
- 如果索引不对应，则补NaN

In [210]:
df2

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96
H      42    57  101      18
I     136   130   18      48
J     145    59   51      45
K     104    85   68     103

In [209]:
df2-10

   Python  Math   En  Physic
A      70   106  127      92
B      64   136  115      61
C      16    11    6     105
D      67   100    2      -1
E     110    27   29      88
F      23    48   19      86
H      32    47   91       8
I     126   120    8      38
J     135    49   41      35
K      94    75   58      93

In [212]:
df2.divide(3).round()

   Python  Math    En  Physic
A    27.0  39.0  46.0    34.0
B    25.0  49.0  42.0    24.0
C     9.0   7.0   5.0    38.0
D    26.0  37.0   4.0     3.0
E    40.0  12.0  13.0    33.0
F    11.0  19.0  10.0    32.0
H    14.0  19.0  34.0     6.0
I    45.0  43.0   6.0    16.0
J    48.0  20.0  17.0    15.0
K    35.0  28.0  23.0    34.0

![](xiefangcha.jpg)

In [213]:
#协方差
df2.cov()

             Python         Math           En       Physic
Python  1779.344444   485.855556  -171.244444  -273.611111
Math     485.855556  1758.322222   777.400000  -474.055556
En      -171.244444   777.400000  2153.822222   151.777778
Physic  -273.611111  -474.055556   151.777778  1458.944444

In [214]:
# 相关性系数
df2.corr()

          Python      Math        En    Physic
Python  1.000000  0.274681 -0.087475 -0.169818
Math    0.274681  1.000000  0.399476 -0.295979
En     -0.087475  0.399476  1.000000  0.085622
Physic -0.169818 -0.295979  0.085622  1.000000

In [215]:
df2.abs()

   Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96
H      42    57  101      18
I     136   130   18      48
J     145    59   51      45
K     104    85   68     103

In [216]:
df2.any()

<bound method DataFrame.any of    Python  Math   En  Physic
A      80   116  137     102
B      74   146  125      71
C      26    21   16     115
D      77   110   12       9
E     120    37   39      98
F      33    58   29      96
H      42    57  101      18
I     136   130   18      48
J     145    59   51      45
K     104    85   68     103>

In [217]:
#方差
df.var()

python     640.3
Math      1904.0
En        2483.5
dtype: float64

创建DataFrame df1 不同人员的各科目成绩，月考一

创建DataFrame df2 不同人员的各科目成绩，月考二  
有新学生转入

下面是Python 操作符与pandas操作函数的对应表：

| Python Operator | Pandas Method(s)                      |
|-----------------|---------------------------------------|
| ``+``           | ``add()``                             |
| ``-``           | ``sub()``, ``subtract()``             |
| ``*``           | ``mul()``, ``multiply()``             |
| ``/``           | ``truediv()``, ``div()``, ``divide()``|
| ``//``          | ``floordiv()``                        |
| ``%``           | ``mod()``                             |
| ``**``          | ``pow()``                             |

（2） Series与DataFrame之间的运算

【重要】

- 使用Python操作符：以行为单位操作（参数必须是行），对所有行都有效。（类似于numpy中二维数组与一维数组的运算，但可能出现NaN）

- 使用pandas操作函数：

        axis=0：以列为单位操作（参数必须是列），对所有列都有效。
        axis=1：以行为单位操作（参数必须是行），对所有行都有效。

============================================

练习6：

1. 假设ddd是期中考试成绩，ddd2是期末考试成绩，请自由创建ddd2，并将其与ddd相加，求期中期末平均值。

2. 假设张三期中考试数学被发现作弊，要记为0分，如何实现？

3. 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？

4. 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

============================================